# group by

In [3]:
import pandas as pd

In [7]:
var = pd.DataFrame({"Name":["a","b","c","d","a","b","a","b","a","c","c","d"],
                    "S_1":[12,13,14,12,13,14,15,23,25,16,10,34],
                    "S_2":[23,24,25,26,27,28,29,30,25,34,35,56]})

In [9]:
var

   Name  S_1  S_2
0     a   12   23
1     b   13   24
2     c   14   25
3     d   12   26
4     a   13   27
5     b   14   28
6     a   15   29
7     b   23   30
8     a   25   25
9     c   16   34
10    c   10   35
11    d   34   56

In [15]:
var_new = var.groupby("Name")

In [17]:
var_new

In [19]:
for x,y in var_new:
    print(x)
    print(y)

a
  Name  S_1  S_2
0    a   12   23
4    a   13   27
6    a   15   29
8    a   25   25
b
  Name  S_1  S_2
1    b   13   24
5    b   14   28
7    b   23   30
c
   Name  S_1  S_2
2     c   14   25
9     c   16   34
10    c   10   35
d
   Name  S_1  S_2
3     d   12   26
11    d   34   56

In [21]:
var_new.get_group("a")

  Name  S_1  S_2
0    a   12   23
4    a   13   27
6    a   15   29
8    a   25   25

In [23]:
var_new.get_group("b")

  Name  S_1  S_2
1    b   13   24
5    b   14   28
7    b   23   30

In [25]:
var_new.get_group("c")

   Name  S_1  S_2
2     c   14   25
9     c   16   34
10    c   10   35

In [27]:
var_new.get_group("d")

   Name  S_1  S_2
3     d   12   26
11    d   34   56

In [29]:
var_new.min()

      S_1  S_2
Name
a      12   23
b      13   24
c      10   25
d      12   26

In [31]:
var_new.max()

      S_1  S_2
Name
a      25   29
b      23   30
c      16   35
d      34   56

In [35]:
var_new.mean()

            S_1        S_2
Name
a     16.250000  26.000000
b     16.666667  27.333333
c     13.333333  31.333333
d     23.000000  41.000000

In [37]:
li = list(var_new)
li

[('a',
    Name  S_1  S_2
  0    a   12   23
  4    a   13   27
  6    a   15   29
  8    a   25   25),
 ('b',
    Name  S_1  S_2
  1    b   13   24
  5    b   14   28
  7    b   23   30),
 ('c',
     Name  S_1  S_2
  2     c   14   25
  9     c   16   34
  10    c   10   35),
 ('d',
     Name  S_1  S_2
  3     d   12   26
  11    d   34   56)]